; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 983674 2 1 4 5 6
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	infrared3 - mode
	image0 - mode
	image1 - mode
	thermograph2 - mode
	GroundStation0 - direction
	GroundStation1 - direction
	GroundStation4 - direction
	GroundStation2 - direction
	Star3 - direction
	Star5 - direction
	Planet6 - direction
	Star7 - direction
	Star8 - direction
	Star9 - direction
	Planet10 - direction
)
(:init
	(supports instrument0 infrared3)
	(supports instrument0 image1)
	(calibration_target instrument0 GroundStation2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star7)
	(supports instrument1 thermograph2)
	(supports instrument1 image0)
	(calibration_target instrument1 Star3)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation1)
)
(:goal (and
	(have_image Star5 image1)
	(have_image Planet6 image1)
	(have_image Star7 image1)
	(have_image Star8 thermograph2)
	(have_image Star9 image1)
	(have_image Planet10 image0)
))

)

; plan
1. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 6
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 6
3. (turn_to satellite1 star8 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 star8)
   goals met: 0 of 6
4. (turn_to satellite0 groundstation2 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 groundstation2)
   goals met: 0 of 6
5. (calibrate satellite0 instrument0 groundstation2)
   added: (calibrated instrument0)
   goals met: 0 of 6
6. (turn_to satellite1 star3 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 star3)
   goals met: 0 of 6
7. (turn_to satellite0 star9 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 star9)
   goals met: 0 of 6
8. (calibrate satellite1 instrument1 star3)
   added: (calibrated instrument1)
   goals met: 0 of 6
9. (take_image satellite0 star9 instrument0 image1)
   added: (have_image star9 image1)
   goals met: 1 of 6
10. (turn_to satellite1 star8 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 star8)
   goals met: 1 of 6
11. (turn_to satellite0 star5 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star5)
   goals met: 1 of 6
12. (take_image satellite1 star8 instrument1 thermograph2)
   added: (have_image star8 thermograph2)
   goals met: 2 of 6
13. (take_image satellite0 star5 instrument0 image1)
   added: (have_image star5 image1)
   goals met: 3 of 6
14. (turn_to satellite1 planet10 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 planet10)
   goals met: 3 of 6
15. (turn_to satellite0 planet6 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 planet6)
   goals met: 3 of 6
16. (take_image satellite1 planet10 instrument1 image0)
   added: (have_image planet10 image0)
   goals met: 4 of 6
17. (take_image satellite0 planet6 instrument0 image1)
   added: (have_image planet6 image1)
   goals met: 5 of 6
18. (turn_to satellite0 star7 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 star7)
   goals met: 5 of 6
19. (take_image satellite0 star7 instrument0 image1)
   added: (have_image star7 image1)
   goals met: 6 of 6
